prog_tes/k6/results/smoke_20260713_122527.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: ./scripts/01_smoke.js
        output: json (./results/smoke_20260713_122527.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m00.7s/10m0s  0/1 shared iters


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=151.52ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8       5.721811/s
    checks_succeeded...: 100.00% 8 out of 8
    checks_failed......: 0.00%   0 out of 8

    ✓ register 201
    ✓ login 200
    ✓ list-endpoints-empty status 2xx
    ✓ create-endpoint status 2xx
    ✓ list-endpoints-one status 2xx
    ✓ get-endpoint-by-id status 2xx
    ✓ webhook-ingress status 2xx
    ✓ list-events status 2xx

    HTTP
    http_req_duration..............: avg=48.87ms min=7.08ms med=21.06ms max=173.51ms p(90)=129.53ms p(95)=151.52ms
      { expected_response:true }...: avg=48.87ms min=7.08ms med=21.06ms max=173.51ms p(90)=129.53ms p(95)=151.52ms
    http_req_failed................: 0.00%  0 out of 8
    http_reqs......................: 8      5.721811/s

    EXECUTION
    iteration_duration.............: avg=1.11s   min=1.11s  med=1.11s   max=1.11s    p(90)=1.11s    p(95)=1.11s   
    iterations.....................: 1      0.715226/s
    vus............................: 1      min=1      max=1
    vus_max........................: 1      min=1      max=1

    NETWORK
    data_received..................: 4.8 kB 3.5 kB/s
    data_sent......................: 2.9 kB 2.0 kB/s



running (00m01.4s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m01.1s/10m0s  1/1 shared iters